#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

/**********************************************************************
 *                          COMMENT                                   *
 **********************************************************************/

int main(void) {
	int matrix1[3][4] = { {1, 2, 3, 4}, {2, 2, 3, 4}, {3, 2, 3, 4} };
	int matrix2[3][4] = { {1, 2}, {2, 2} };
	int matrix3[3][4] = { 1, 2, 3, 4, 2, 2, 3, 4, 3, 2, 3, 4 }; // 不推荐！
	int matrix4[3][4] = { 0 }; // 推荐！
	
	/* WRONG: 只能省略第一个维度，后面维度为数组元素的类型 */
	// int matrix5[3][] = { {1, 2, 3, 4}, {2, 2, 3, 4}, {3, 2, 3, 4} };
	return 0;
}