#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

/**********************************************************************
 *                          COMMENT                                   *
 **********************************************************************/
/*
常量数组：不能修改数组的元素！

好处：
	a. 防止篡改，安全
	b. 有助于编译器优化程序。
应用场景：
	存储不会发生改变的数据 (静态数据)
*/
int main(void) {
	const char hex_chars[] = { '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',
		 'A', 'B', 'C', 'D', 'E', 'F' };

	// hex_chars[9] = 'X';
	return 0;
}